# Use with `brew bundle`
#
# Install these Homebrew formula globally:
#   brew bundle
#
# List all installed Homebrew formula not listed below:
#   brew bundle cleanup
#
# Uninstall all installed Homebrew formula not listed below:
#   brew bundle cleanup --force
#
# Full instructions: https://github.com/Homebrew/homebrew-bundle

# Enable casks
tap "homebrew/cask"

#
# Updated built-in system tools
#

brew "git" # Latest Git (For security updates)
brew "ruby" # Latest Ruby (Used by Jekyll on feross.org)
brew "python" # Latest Python
brew "pipenv" # Node-style local modules for Python

#
# Useful command line tools
#

brew "wget" # GNU Wget
brew "hub" # GitHub CLI
brew "fd" # Better "find"
brew "youtube-dl" # YouTube downloader
brew "siege" # HTTP load testing and benchmarking utility
cask "ngrok" # Secure tunnels to localhost

#
# Project dependencies
#

# feross.org

brew "gsl" # GNU Scientific Library (Used by Jekyll)

# bitmidi.com

brew "cmake" # Cmake (Used by emscripten)
brew "emscripten" # Emscripten (Used by timidity)
brew "graphicsmagick" # GraphicsMagick

# airtap

cask "sauce-connect" # Sauce Connect
